An alternative to using MySQL Connector is using a package called SQLAlchemy. This package offers a one-stop method for connecting to a range of different databases, including MySQL. One of the nice things about using SQLAlchemy is that the syntax for querying different database types remains consistent across database types, saving you from remembering a bunch of different commands if youâ€™re working with a lot of different databases.

To read in the data using SQLAlchemy, we need:
1) install SQLAlchemy and create engine

In [13]:
import pandas as pd
from sqlalchemy import create_engine, text

read_sql_query() throws "'OptionEngine' object has no attribute 'execute'" with SQLAlchemy 2.0.0 as this version has removed engine.execute command. One of the workaround methods is to wrap the query in text:

In [14]:
engine = create_engine('mysql+mysqlconnector://root:@127.0.0.1/ORG', echo = False)
conn = engine.connect()

query = text('SELECT * FROM Worker')
dataframe = pd.read_sql_query(query, conn)
dataframe

   WORKER_ID FIRST_NAME LAST_NAME  SALARY        JOINING_DATE DEPARTMENT
0          1     Monika     Arora  100000 2014-02-20 09:00:00         HR
1          2   Niharika     Verma   80000 2014-06-11 09:00:00      Admin
2          3     Vishal   Singhal  300000 2014-02-20 09:00:00         HR
3          4    Amitabh     Singh  500000 2014-02-20 09:00:00      Admin
4          5      Vivek     Bhati  500000 2014-06-11 09:00:00      Admin
5          6      Vipul     Diwan  200000 2014-06-11 09:00:00    Account
6          7     Satish     Kumar   75000 2014-01-20 09:00:00    Account
7          8    Geetika   Chauhan   90000 2014-04-11 09:00:00      Admin

Write into SQL:
1) create a table
2) use :to_sql function to add a new table to your SQL file

In [15]:
dataframe1 = pd.DataFrame({'name' : ['User 1', 'User 2', 'User 3'],'lastname' : ['bob','abra','pink'], 'age' : [22,44,55]})
dataframe1

     name lastname  age
0  User 1      bob   22
1  User 2     abra   44
2  User 3     pink   55

In [82]:
# create the table in the database
with engine.connect() as conn, conn.begin():
    create_table_query = text('CREATE TABLE sample_table2 (name VARCHAR(50), lastname VARCHAR(50), age INT)')
    conn.execute(create_table_query)

# write the DataFrame to the table
dataframe1.to_sql('sample_table2', con=engine, if_exists='append', index=False)

3

Couple of things to remember:
Refresh your MySQL Workbench file by clicking "reconnect to DBMS" to see your newly added table
If you need to make any changes, do not forget to "Drop table" first in the SQL to avoid "the table already exists error"